In [1]:
import numpy as np

In [2]:
import pandas as pd

In [13]:
#creating a dictionary with missing values
d ={'a':(1,2,3,4,5),
    'b':(6,7,8,9,np.nan),
    'c':(0,1,2,np.nan,np.nan),
   'd':(3,4,np.nan,np.nan,np.nan),
   'e':(5,np.nan,np.nan,np.nan,np.nan)}

In [14]:
d

{'a': (1, 2, 3, 4, 5),
 'b': (6, 7, 8, 9, nan),
 'c': (0, 1, 2, nan, nan),
 'd': (3, 4, nan, nan, nan),
 'e': (5, nan, nan, nan, nan)}

In [15]:
#converting dictionary to a data frame

In [18]:
df =pd.DataFrame(d)

In [19]:
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [20]:
#drop missing vallue directly

In [43]:
df.dropna(axis =0) #0 for row 1 for coloumns

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

In [27]:
df.dropna(thresh=1) #minimum have one value

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [32]:
df.dropna(thresh=5) #minimum have five value requirement

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

In [33]:
# fill null value with a specific value

In [34]:
#we wnat to fill the null values with 1

df.fillna(1)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  1.0
2  3  8.0  2.0  1.0  1.0
3  4  9.0  1.0  1.0  1.0
4  5  1.0  1.0  1.0  1.0

In [37]:
#fill a specific columns values "b"
#lest change the "b" columns missing value

df['b'].fillna(value=1)

0    6.0
1    7.0
2    8.0
3    9.0
4    1.0
Name: b, dtype: float64

In [40]:
#lets fill the "d" columns null value with the
#all values average of "b"

df['b'].fillna(value = df['b'].mean())

0    6.0
1    7.0
2    8.0
3    9.0
4    7.5
Name: b, dtype: float64